<?php
/*
 * Автор: Иван Краузе
 *
 * Дата реализации: 27.07.2022 15:38
 *
 * Дата изменения: 27.07.2022 15:44
 *
 * Содержит класс для работы со списками людей
 */

/*
 * Класс PeopleList предоставляет методы для поиска людей в БД, представления людей списком (массивом), удаления людей
 *  из БД на основе списка (массива).
 */
class PeopleList
{
    /*
     * TODO:
     * [+] Добавить поле-массив с id людей.
     * [+] Добавить метод-конструктор для поиска id людей по всем полям БД (больше, меньше, не равно).
     * [+] Добавить метод для получения массива экземпляров класса PeopleDB из массива с id (поле класса).
     * [+] Добавить метод для удаления людей из БД с помощью экземпляров класса PeopleDB из массива с id.
     * [+] Добавить проверку на наличие класса PeopleDB.
     */
}