<?php
/*
 * Автор: Иван Краузе
 *
 * Дата реализации: 27.07.2022 15:27
 *
 * Дата изменения: 27.07.2022 15:37
 *
 * Содержит класс для работы с базой данных людей
 */

/*
 * Класс PeopleDB предоставляет методы для сохранения и удаления информации из базы данных, а также для различных
 *  преобразования данных.
 */
class PeopleDB
{
    /*
     * TODO:
     * [+] Добавить поля: id, имя, фамилия, дата рождения, пол (0, 1), город рождения.
     * [+] Добавить метод для сохранения полей экземляра класса в БД.
     * [+] Добавить метод для удаления человека из БД в соответствии с id объекта.
     * [+] Добавить метод для static преобразования даты рождения в возраст (полных лет).
     * [+] Добавить метод для static преобразования пола из двоичной системы в текстовую (муж, жен).
     * [+] Добавить метод-конструктор для создания человека в БД (если задана информация).
     * [+] Добавить метод-конструктор для представления информации из БД по id (w/ валидация).
     * [+] Добавить метод для форматирования данных человека (преобразованрие возраста и/или пола).
     */
}